balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F65K22.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXREG2" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="TXREG2" edc:nzwidth="8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXREG2" edc:desc="" edc:mask="0xff" edc:name="TXREG2" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RCREG2" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="RCREG2" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RCREG2" edc:desc="" edc:mask="0xff" edc:name="RCREG2" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SPBRG2" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="SPBRG2" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPBRG2" edc:desc="" edc:mask="0xff" edc:name="SPBRG2" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SPBRGH2" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="SPBRGH2" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPBRGH2" edc:desc="" edc:mask="0xff" edc:name="SPBRGH2" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnn-nn" edc:cname="BAUDCON2" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxx-xx" edc:name="BAUDCON2" edc:nzwidth="8" edc:por="01000-00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ABDEN" edc:desc="" edc:mask="0x1" edc:name="ABDEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WUE" edc:desc="" edc:mask="0x1" edc:name="WUE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="BRG16" edc:desc="" edc:mask="0x1" edc:name="BRG16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXCKP" edc:desc="" edc:mask="0x1" edc:name="TXCKP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXDTP" edc:desc="" edc:mask="0x1" edc:name="RXDTP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RCIDL" edc:desc="" edc:mask="0x1" edc:name="RCIDL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ABDOVF" edc:desc="" edc:mask="0x1" edc:name="ABDOVF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXSTA2" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="TXSTA2" edc:nzwidth="8" edc:por="00000010">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TX9D" edc:desc="" edc:mask="0x1" edc:name="TX9D" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRMT" edc:desc="" edc:mask="0x1" edc:name="TRMT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BRGH" edc:desc="" edc:mask="0x1" edc:name="BRGH" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SENDB" edc:desc="" edc:mask="0x1" edc:name="SENDB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SYNC" edc:desc="" edc:mask="0x1" edc:name="SYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXEN" edc:desc="" edc:mask="0x1" edc:name="TXEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TX9" edc:desc="" edc:mask="0x1" edc:name="TX9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSRC" edc:desc="" edc:mask="0x1" edc:name="CSRC" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TX9D2" edc:desc="" edc:mask="0x1" edc:name="TX9D2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRMT2" edc:desc="" edc:mask="0x1" edc:name="TRMT2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BRGH2" edc:desc="" edc:mask="0x1" edc:name="BRGH2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SENDB2" edc:desc="" edc:mask="0x1" edc:name="SENDB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SYNC2" edc:desc="" edc:mask="0x1" edc:name="SYNC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXEN2" edc:desc="" edc:mask="0x1" edc:name="TXEN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX92" edc:desc="" edc:mask="0x1" edc:name="TX92" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CSRC2" edc:desc="" edc:mask="0x1" edc:name="CSRC2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RCSTA2" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="RCSTA2" edc:nzwidth="8" edc:por="0000000x">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RX9D" edc:desc="" edc:mask="0x1" edc:name="RX9D" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OERR" edc:desc="" edc:mask="0x1" edc:name="OERR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FERR" edc:desc="" edc:mask="0x1" edc:name="FERR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADDEN" edc:desc="" edc:mask="0x1" edc:name="ADDEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CREN" edc:desc="" edc:mask="0x1" edc:name="CREN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SREN" edc:desc="" edc:mask="0x1" edc:name="SREN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RX9" edc:desc="" edc:mask="0x1" edc:name="RX9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SPEN" edc:desc="" edc:mask="0x1" edc:name="SPEN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RX9D2" edc:desc="" edc:mask="0x1" edc:name="RX9D2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OERR2" edc:desc="" edc:mask="0x1" edc:name="OERR2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FERR2" edc:desc="" edc:mask="0x1" edc:name="FERR2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADDEN2" edc:desc="" edc:mask="0x1" edc:name="ADDEN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CREN2" edc:desc="" edc:mask="0x1" edc:name="CREN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SREN2" edc:desc="" edc:mask="0x1" edc:name="SREN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RX92" edc:desc="" edc:mask="0x1" edc:name="RX92" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPEN2" edc:desc="" edc:mask="0x1" edc:name="SPEN2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
