balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F65K22.PIC
        <edc:SFRDef edc:access="n-nnnnnn" edc:cname="PIE3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-000000" edc:name="PIE3" edc:nzwidth="0x8" edc:por="0-000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RTCCIE" edc:desc="" edc:mask="0x1" edc:name="RTCCIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP1IE" edc:desc="" edc:mask="0x1" edc:name="CCP1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP2IE" edc:desc="" edc:mask="0x1" edc:name="CCP2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CTMUIE" edc:desc="" edc:mask="0x1" edc:name="CTMUIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX2IE" edc:desc="" edc:mask="0x1" edc:name="TX2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC2IE" edc:desc="" edc:mask="0x1" edc:name="RC2IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TMR5GIE" edc:desc="" edc:mask="0x1" edc:name="TMR5GIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-rnnnnn" edc:cname="PIR3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-000000" edc:name="PIR3" edc:nzwidth="0x8" edc:por="0-000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RTCCIF" edc:desc="" edc:mask="0x1" edc:name="RTCCIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP1IF" edc:desc="" edc:mask="0x1" edc:name="CCP1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP2IF" edc:desc="" edc:mask="0x1" edc:name="CCP2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CTMUIF" edc:desc="" edc:mask="0x1" edc:name="CTMUIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX2IF" edc:desc="" edc:mask="0x1" edc:name="TX2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC2IF" edc:desc="" edc:mask="0x1" edc:name="RC2IF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TMR5GIF" edc:desc="" edc:mask="0x1" edc:name="TMR5GIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-nnnnnn" edc:cname="IPR3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1-111111" edc:name="IPR3" edc:nzwidth="0x8" edc:por="1-111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RTCCIP" edc:desc="" edc:mask="0x1" edc:name="RTCCIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP1IP" edc:desc="" edc:mask="0x1" edc:name="CCP1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP2IP" edc:desc="" edc:mask="0x1" edc:name="CCP2IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CTMUIP" edc:desc="" edc:mask="0x1" edc:name="CTMUIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX2IP" edc:desc="" edc:mask="0x1" edc:name="TX2IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC2IP" edc:desc="" edc:mask="0x1" edc:name="RC2IP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TMR5GIP" edc:desc="" edc:mask="0x1" edc:name="TMR5GIP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---n-nnn" edc:cname="PIR6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---x-xxx" edc:name="PIR6" edc:nzwidth="0x8" edc:por="---0-000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CMP1IF" edc:desc="" edc:mask="0x1" edc:name="CMP1IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMP2IF" edc:desc="" edc:mask="0x1" edc:name="CMP2IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMP3IF" edc:desc="" edc:mask="0x1" edc:name="CMP3IF" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EEIF" edc:desc="" edc:mask="0x1" edc:name="EEIF" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn----" edc:cname="PSPCON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxx----" edc:name="PSPCON" edc:nzwidth="0x8" edc:por="xxxx----">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PSPMODE" edc:desc="" edc:mask="0x1" edc:name="PSPMODE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IBOV" edc:desc="" edc:mask="0x1" edc:name="IBOV" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OBF" edc:desc="" edc:mask="0x1" edc:name="OBF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IBF" edc:desc="" edc:mask="0x1" edc:name="IBF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="HLVDCON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="HLVDCON" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="HLVDL" edc:desc="" edc:mask="0xf" edc:name="HLVDL" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="HLVDEN" edc:desc="" edc:mask="0x1" edc:name="HLVDEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IRVST" edc:desc="" edc:mask="0x1" edc:name="IRVST" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BGVST" edc:desc="" edc:mask="0x1" edc:name="BGVST" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VDIRMAG" edc:desc="" edc:mask="0x1" edc:name="VDIRMAG" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="HLVDL0" edc:desc="" edc:mask="0x1" edc:name="HLVDL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HLVDL1" edc:desc="" edc:mask="0x1" edc:name="HLVDL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HLVDL2" edc:desc="" edc:mask="0x1" edc:name="HLVDL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HLVDL3" edc:desc="" edc:mask="0x1" edc:name="HLVDL3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---n-nnn" edc:cname="IPR6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---x-xxx" edc:name="IPR6" edc:nzwidth="0x8" edc:por="---0-000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CMP1IP" edc:desc="" edc:mask="0x1" edc:name="CMP1IP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMP2IP" edc:desc="" edc:mask="0x1" edc:name="CMP2IP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMP3IP" edc:desc="" edc:mask="0x1" edc:name="CMP3IP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EEIP" edc:desc="" edc:mask="0x1" edc:name="EEIP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="rp" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="T1GCON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="T1GCON" edc:nzwidth="0x8" edc:por="00000x00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T1GSS" edc:desc="" edc:mask="0x3" edc:name="T1GSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="T1GVAL" edc:desc="" edc:mask="0x1" edc:name="T1GVAL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T1GGO_nT1DONE" edc:desc="" edc:mask="0x1" edc:name="T1GGO_nT1DONE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T1GSPM" edc:desc="" edc:mask="0x1" edc:name="T1GSPM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T1GTM" edc:desc="" edc:mask="0x1" edc:name="T1GTM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T1GPOL" edc:desc="" edc:mask="0x1" edc:name="T1GPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR1GE" edc:desc="" edc:mask="0x1" edc:name="TMR1GE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T1GSS0" edc:desc="" edc:mask="0x1" edc:name="T1GSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T1GSS1" edc:desc="" edc:mask="0x1" edc:name="T1GSS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T1GGO" edc:desc="" edc:mask="0x1" edc:name="T1GGO" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="nT1DONE" edc:desc="" edc:mask="0x1" edc:name="nT1DONE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnrrn" edc:cname="RCSTA1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0u00u00u" edc:name="RCSTA1" edc:nzwidth="0x8" edc:por="0000000x">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="RCSTA"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RX9D" edc:desc="" edc:mask="0x1" edc:name="RX9D" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OERR" edc:desc="" edc:mask="0x1" edc:name="OERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FERR" edc:desc="" edc:mask="0x1" edc:name="FERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADDEN" edc:desc="" edc:mask="0x1" edc:name="ADDEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CREN" edc:desc="" edc:mask="0x1" edc:name="CREN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SREN" edc:desc="" edc:mask="0x1" edc:name="SREN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RX9" edc:desc="" edc:mask="0x1" edc:name="RX9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPEN" edc:desc="" edc:mask="0x1" edc:name="SPEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RCD8" edc:desc="" edc:mask="0x1" edc:name="RCD8" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="ADEN" edc:desc="" edc:mask="0x1" edc:name="ADEN" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RC9" edc:desc="" edc:mask="0x1" edc:name="RC9" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="nRC8" edc:desc="" edc:mask="0x1" edc:name="nRC8" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="RC8_9" edc:desc="" edc:mask="0x1" edc:name="RC8_9" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:SFRFieldDef edc:cname="RX9D1" edc:desc="" edc:mask="0x1" edc:name="RX9D1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OERR1" edc:desc="" edc:mask="0x1" edc:name="OERR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FERR1" edc:desc="" edc:mask="0x1" edc:name="FERR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADDEN1" edc:desc="" edc:mask="0x1" edc:name="ADDEN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CREN1" edc:desc="" edc:mask="0x1" edc:name="CREN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SREN1" edc:desc="" edc:mask="0x1" edc:name="SREN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RX91" edc:desc="" edc:mask="0x1" edc:name="RX91" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPEN1" edc:desc="" edc:mask="0x1" edc:name="SPEN1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnrn" edc:cname="TXSTA1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0u00001u" edc:name="TXSTA1" edc:nzwidth="0x8" edc:por="00000010">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="TXSTA"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TX9D" edc:desc="" edc:mask="0x1" edc:name="TX9D" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRMT" edc:desc="" edc:mask="0x1" edc:name="TRMT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BRGH" edc:desc="" edc:mask="0x1" edc:name="BRGH" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SENDB" edc:desc="" edc:mask="0x1" edc:name="SENDB" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SYNC" edc:desc="" edc:mask="0x1" edc:name="SYNC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXEN" edc:desc="" edc:mask="0x1" edc:name="TXEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX9" edc:desc="" edc:mask="0x1" edc:name="TX9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CSRC" edc:desc="" edc:mask="0x1" edc:name="CSRC" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TXD8" edc:desc="" edc:mask="0x1" edc:name="TXD8" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="TX8_9" edc:desc="" edc:mask="0x1" edc:name="TX8_9" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="nTX8" edc:desc="" edc:mask="0x1" edc:name="nTX8" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="TX9D1" edc:desc="" edc:mask="0x1" edc:name="TX9D1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRMT1" edc:desc="" edc:mask="0x1" edc:name="TRMT1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BRGH1" edc:desc="" edc:mask="0x1" edc:name="BRGH1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SENDB1" edc:desc="" edc:mask="0x1" edc:name="SENDB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SYNC1" edc:desc="" edc:mask="0x1" edc:name="SYNC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXEN1" edc:desc="" edc:mask="0x1" edc:name="TXEN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX91" edc:desc="" edc:mask="0x1" edc:name="TX91" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CSRC1" edc:desc="" edc:mask="0x1" edc:name="CSRC1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="wwwwwwww" edc:cname="TXREG1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="TXREG1" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="TXREG"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXREG1" edc:desc="" edc:mask="0xff" edc:name="TXREG1" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RCREG1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="RCREG1" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="RCREG"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RCREG1" edc:desc="" edc:mask="0xff" edc:name="RCREG1" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="rp" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
